gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    for (int i = 0; i < imageLength; i++) {
        fputc(imageData[i], imageFile);
    }

    fclose(imageFile);

    imageNumber++;

    // Save the temperature data
    // if (sd_card_add_temp_to_csv(DateTime, Temp1, Temp2) != TRUE) {
    //     bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed to save temperature data\0");
    //     esp32_uart_send_bpacket(Bpacket);
    //     return FALSE;
    // }

    return TRUE;
}

uint8_t sd_card_delete_file(char* fileName, char* msg) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        sprintf(msg, "SD Card could not open");
        return FALSE;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(fileName);
    char filePath[filePathNameSize + 30]; // add one for null pointer!
    sprintf(filePath, "%s/%s", DATA_FOLDER_PATH_START_AT_ROOT, fileName);

    if (remove(filePath) != 0) {
        sprintf(msg, "File %s could not be deleted", filePath);
        sd_card_close();
        return FALSE;
    }

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_copy_file(char* fileName, char* msg) {

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        sprintf(msg, "SD Card could not open");
        return FALSE;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(fileName);
    char filePath[filePathNameSize + 30]; // add extra for mount point and null pointer!
    sprintf(filePath, "%s/%s", DATA_FOLDER_PATH_START_AT_ROOT, fileName);

    FILE* file;
    if (sd_card_open_file(&file, filePath, SD_CARD_FILE_READ, msg) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    bpk_t Bpacket;
    bpk_create(&Bpacket, BPK_Addr_Receive_Stm32, BPK_Addr_Send_Esp32, BPK_Req_Copy_File, BPK_Code_In_Progress, 0, NULL);
    int index = 0;

    int c;
    while ((c = fgetc(file)) != EOF) {
        Bpacket.Data.bytes[index++] = (uint8_t)c;

        if (index < BPACKET_MAX_NUM_DATA_BYTES) {
            // index++;
            continue;
        }

        /* Send bpacket to STM32 */
        Bpacket.Data.numBytes = index;
        esp32_uart_send_bpacket(&Bpacket);
        index = 0;

        /* Wait for 100ms to give time for STM to do its thing */
        vTaskDelay(1000 / portTICK_PERIOD_MS);
    }

    // Send any remaining data
    Bpacket.Data.numBytes = index;
    Bpacket.Code          = BPK_Code_Success;
    esp32_uart_send_bpacket(&Bpacket);

    fclose(file);

    // Close the SD card
    sd_card_close();

    return TRUE;
}

// uint8_t sd_card_format_sd_card(bpk_t* Bpacket) {

//     char errMsg[50];

//     // Return error message if the SD card cannot be opened
//     if (sd_card_open() != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "SD card failed to open\r\n\0");
//         return FALSE;
//     }

//     /****** START CODE BLOCK ******/
//     // Description: Confirm all the correct folders on the SD card exist

//     // Create watchdog folder if necessary
//     if (sd_card_create_path(WATCHDOG_FOLDER_PATH, Bpacket) != TRUE) {
//         sd_card_close();
//         return FALSE;
//     }

//     // Create data folder if necessary
//     if (sd_card_create_path(DATA_FOLDER_PATH, Bpacket) != TRUE) {
//         sd_card_close();
//         return FALSE;
//     }

//     // Create logs folder if necessary
//     if (sd_card_create_path(LOG_FOLDER_PATH, Bpacket) != TRUE) {
//         sd_card_close();
//         return FALSE;
//     }

//     // Create settings folder if necessary
//     // if (sd_card_create_path(SETTINGS_FOLDER_PATH, Bpacket) != TRUE) {
//     //     sd_card_close();
//     //     return FALSE;
//     // }

//     /****** END CODE BLOCK ******/

//     /****** START CODE BLOCK ******/
//     // Description: Confirm the settings file exists and that it has valid data

//     // Create the settings file if required
//     // if (sd_card_create_file(SETTINGS_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
//     //     bpk_create_string_response(Bpacket, BPK_Code_Error, errMsg);
//     //     esp32_uart_send_bpacket(Bpacket);
//     //     return FALSE;
//     // }

//     uint32_t numBytes = 0;

//     // Write default settings to settings file the file is empty
//     if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &numBytes, errMsg) != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, errMsg);
//         esp32_uart_send_bpacket(Bpacket);
//         sd_card_close();
//         return FALSE;
//     }

//     // if (numBytes == 0) {

//     //     // Write the default camera settings to the SD card
//     //     bpk_t cSettings;
//     //     if (wd_camera_settings_to_bpacket(&cSettings, Bpacket->Receiver, Bpacket->Sender,
//     //     BPK_Req_Set_Camera_Settings,
//     //                                       BPK_Code_Execute, &deafultCameraSettings) != TRUE) {
//     //         bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default camera settings\r\n\0");
//     //         sd_card_close();
//     //         return FALSE;
//     //     }

//     //     if (sd_card_write_settings(&cSettings) != TRUE) {
//     //         bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default camera settings\r\n\0");
//     //         sd_card_close();
//     //         return FALSE;
//     //     }

//     //     // Write the default capture time settings to the SD card
//     //     bpk_t ctSettings;
//     //     if (wd_capture_time_settings_to_bpacket(&ctSettings, Bpacket->Receiver, Bpacket->Sender,
//     //                                             BPK_Req_Set_Camera_Capture_Times, BPK_Code_Execute,
//     //                                             &defaultCaptureTimeSettings) != TRUE) {
//     //         bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed setting default capture time
//     //         settings\r\n\0"); sd_card_close(); return FALSE;
//     //     }

//     //     if (sd_card_write_settings(&ctSettings) != TRUE) {
//     //         bpk_create_string_response(Bpacket, BPK_Code_Error, "Settings default capture time settings
//     //         failed\r\n\0"); sd_card_close(); return FALSE;
//     //     }
//     // }

