gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    // Write log to file
    fprintf(file, log);

    fclose(file);

    return TRUE;
}

uint8_t sd_card_log(char* fileName, char* message) {
    char name[30];
    sprintf(name, "%s", fileName); // Doing this so \0 is added to the end
    return sd_card_write(LOG_FOLDER_PATH_START_AT_ROOT, name, message);
}

// uint8_t sd_card_save_image1(uint8_t* imageData, int imageLength, bpk_t* Bpacket) {

//     // Extract the RTC and temperatre data from the Bpacket
//     // cdt_dbl_16_t Temp1, Temp2;
//     dt_datetime_t DateTime = {
//         .Date.day    = 1,
//         .Date.month  = 2,
//         .Date.year   = 3,
//         .Time.second = 1,
//         .Time.minute = 1,
//         .Time.hour   = 1,
//     };
//     // uint8_t result = wd_bpacket_to_photo_data(Bpacket, &DateTime, &Temp1, &Temp2);

//     // if (result != TRUE) {
//     //     char err[50];
//     //     wd_get_error(result, err);
//     //     bpk_create_string_response(Bpacket, BPK_Code_Error, err);
//     //     esp32_uart_send_bpacket(Bpacket);
//     //     return FALSE;
//     // }

//     // Try open the SD card
//     if (sd_card_open() != TRUE) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "Could not open the SD card\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     // // Create the data folder path if required
//     // if (sd_card_create_path(DATA_FOLDER_PATH, Bpacket) != TRUE) {
//     //     bpk_create_sp(Bpacket, sender, Receiver, Request, BPK_Code_Error,
//     //                       "Could not create path to data folder\0");
//     //     esp32_uart_send_bpacket(Bpacket);
//     //     return FALSE;
//     // }

//     // Create formatted image number in the format of xxx
//     char imgNumString[8];
//     sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

//     // Create formatted date time in the format yymmdd_hhmm
//     char datetimeString[40];
//     sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", DateTime.Date.year - 2000, DateTime.Date.month < 10 ? "0" : "",
//             DateTime.Date.month, DateTime.Date.day < 10 ? "0" : "", DateTime.Date.day,
//             DateTime.Time.hour < 10 ? "0" : "", DateTime.Time.hour, DateTime.Time.minute < 10 ? "0" : "",
//             DateTime.Time.minute);

//     // Create path for image
//     char filePath[80];
//     sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, DATA_FOLDER_PATH, imgNumString, datetimeString);

//     FILE* imageFile = fopen(filePath, "wb");
//     if (imageFile == NULL) {
//         bpk_create_string_response(Bpacket, BPK_Code_Error, "Image file failed to open\0");
//         esp32_uart_send_bpacket(Bpacket);
//         return FALSE;
//     }

//     for (int i = 0; i < imageLength; i++) {
//         fputc(imageData[i], imageFile);
//     }

//     fclose(imageFile);

//     imageNumber++;

//     // Save the temperature data
//     // if (sd_card_add_temp_to_csv(DateTime, Temp1, Temp2) != TRUE) {
//     //     bpk_create_string_response(Bpacket, BPK_Code_Error, "Failed to save temperature data\0");
//     //     esp32_uart_send_bpacket(Bpacket);
//     //     return FALSE;
//     // }

//     return TRUE;
// }